In [1]:
#importations
import pandas as pd    

#initialisation des variables
path = "./Data/eleves.csv"

In [5]:
df_test = pd.read_csv(path, encoding="latin1")
df_test.head()

   id   prenom      nom    sexe date_naissance  classe
0   1  Gabriel    Morin  Garçon     2007-10-04       3
1   2      Léa   Benoit   Fille     2005-12-30       1
2   3    Tiago    Morel  Garçon     2008-10-31       4
3   4     Emma      Roy   Fille     2011-06-04       6
4   5   Louise  Lacroix   Fille     2005-09-08       1

In [8]:
df_test.tail()

        id   prenom       nom    sexe date_naissance  classe
4995  4996      Tom    Bonnet  Garçon     2010-04-22       6
4996  4997    Chloé    Moreau   Fille     2011-09-18       7
4997  4998  Margaux     Henry   Fille     2006-11-05       2
4998  4999     Mila  Fontaine   Fille     2006-03-09       2
4999  5000     Nina  Martinez   Fille     2007-10-26       3

In [9]:
df_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id              5000 non-null   int64
 1   prenom          5000 non-null   object
 2   nom             5000 non-null   object
 3   sexe            5000 non-null   object
 4   date_naissance  5000 non-null   object
 5   classe          5000 non-null   int64
dtypes: int64(2), object(4)
memory usage: 234.5+ KB

In [10]:
#récupération simple de données
df_simple = pd.read_csv(path, encoding='latin1', parse_dates=['date_naissance'])
df_simple

        id   prenom       nom    sexe date_naissance  classe
0        1  Gabriel     Morin  Garçon     2007-10-04       3
1        2      Léa    Benoit   Fille     2005-12-30       1
2        3    Tiago     Morel  Garçon     2008-10-31       4
3        4     Emma       Roy   Fille     2011-06-04       6
4        5   Louise   Lacroix   Fille     2005-09-08       1
...    ...      ...       ...     ...            ...     ...
4995  4996      Tom    Bonnet  Garçon     2010-04-22       6
4996  4997    Chloé    Moreau   Fille     2011-09-18       7
4997  4998  Margaux     Henry   Fille     2006-11-05       2
4998  4999     Mila  Fontaine   Fille     2006-03-09       2
4999  5000     Nina  Martinez   Fille     2007-10-26       3

[5000 rows x 6 columns]

In [11]:
df_simple.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id              5000 non-null   int64
 1   prenom          5000 non-null   object
 2   nom             5000 non-null   object
 3   sexe            5000 non-null   object
 4   date_naissance  5000 non-null   datetime64[ns]
 5   classe          5000 non-null   int64
dtypes: datetime64[ns](1), int64(2), object(3)
memory usage: 234.5+ KB

In [12]:
#récupération des dataframes
df = pd.read_csv(path, encoding='latin1', dtype={'id': 'int', 'prenom': 'string', 'nom': 'string', 'sexe': 'string', 'classe': 'int'}, parse_dates=['date_naissance'], on_bad_lines='error')
df

        id   prenom       nom    sexe date_naissance  classe
0        1  Gabriel     Morin  Garçon     2007-10-04       3
1        2      Léa    Benoit   Fille     2005-12-30       1
2        3    Tiago     Morel  Garçon     2008-10-31       4
3        4     Emma       Roy   Fille     2011-06-04       6
4        5   Louise   Lacroix   Fille     2005-09-08       1
...    ...      ...       ...     ...            ...     ...
4995  4996      Tom    Bonnet  Garçon     2010-04-22       6
4996  4997    Chloé    Moreau   Fille     2011-09-18       7
4997  4998  Margaux     Henry   Fille     2006-11-05       2
4998  4999     Mila  Fontaine   Fille     2006-03-09       2
4999  5000     Nina  Martinez   Fille     2007-10-26       3

[5000 rows x 6 columns]

In [13]:
#informations sur le dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id              5000 non-null   int32
 1   prenom          5000 non-null   string
 2   nom             5000 non-null   string
 3   sexe            5000 non-null   string
 4   date_naissance  5000 non-null   datetime64[ns]
 5   classe          5000 non-null   int32
dtypes: datetime64[ns](1), int32(2), string(3)
memory usage: 195.4 KB

In [14]:
#affichage des données statistiques du dataframe
df.describe()

                id       classe
count  5000.000000  5000.000000
mean   2500.500000     3.981600
std    1443.520003     1.999715
min       1.000000     1.000000
25%    1250.750000     2.000000
50%    2500.500000     4.000000
75%    3750.250000     6.000000
max    5000.000000     7.000000

In [ ]:
df

In [13]:
#sélection de colonnes spécifiques
df_prenom_nom = df[['prenom', 'nom']]

In [ ]:
df_prenom_nom

In [ ]:
df.columns

In [ ]:
df[[df.columns[0], df.columns[2]]]

In [ ]:
#Affichage du nom des colonnes
df.columns

In [ ]:
#Filtrage de données
donnees_filtrees = df[df['sexe'] == 'Fille']
donnees_filtrees

In [ ]:
#Filtrage de données (opération ET)
donnees_filtrees2 = df[(df['date_naissance'].dt.year > 2007) & (df['sexe'] == 'Fille')]
donnees_filtrees2

In [ ]:
#Filtrage de données (opération OU)
donnees_filtrees3 = df[(df['date_naissance'].dt.year > 2007) | (df['sexe'] == 'Fille')]
donnees_filtrees3

In [ ]:
#Filtrage de données (opération NON)
donnees_filtrees4 = df[~(df['date_naissance'].dt.year > 2007)]
donnees_filtrees4

In [ ]:
#Ajout d'une nouvelle colonne basée sur des calculs
df['nom_prenom'] = df['prenom'] + " " + df['nom']
df

In [ ]:
#Renommer une colonne
df.rename(columns={'prenom': 'first name'}, inplace=True)
df

In [ ]:
#Suppression de colonnes
df = df.drop("nom_prenom", axis="columns")
df

In [ ]:
#Suppression de ligne
df.drop([4999], axis="index")

In [ ]:
#Tri des données
donnees_triees = df.sort_values(by='date_naissance', ascending=True)
donnees_triees

In [ ]:
#Calculs statistiques
moyenne = df['date_naissance'].mean()
mediane = df['date_naissance'].median()
f"moyenne: {moyenne}; mediane: {mediane}"

In [ ]:
df.columns

In [ ]:
type(df['classe'])

In [ ]:
type(df)

In [ ]:
#def incrementer(classe):
#    return classe+1

# Appliquer une fonction personnalisée à une colonne
df['class_plus_un'] = df['classe'].apply(lambda classe: classe+1)
df

In [ ]:
# Appliquer une fonction personnalisée à 2 colonnes
# df['nom_prenom'] = df['prenom'] + " " + df['nom']

def generer_nom_prenom(data_row):
    return f"{data_row['first name']} {data_row['nom']}"

df['nom_prenom'] = df.apply(generer_nom_prenom, axis="columns")

df